{
  "negativos": [
    "No lo se.",
    "La clase de catedra está bien pero en laboratorio sería bueno que la profesora ayudase a los alumnos con sus proyectos respondiendo dudas que surgannbsp",
    "Establecer controles para insentivar el estudio de los alumnos ya que es un ramo que requiere el estar constantemente estudiando para obtener un buen rendimiento.",
    "pasar la materia un poco mas lento",
    "Lo que podría mejorar es tener menos alumnos por profesor asi seria mucho mas eficiente la manera de explicar.",
    "ninguna es un buen profesor.",
    "Algunas veces se siente poco comunicativo",
    "mas ejercitacion por contenido",
    "nada en especifico",
    "Deberia tener mayor cantidad de evaluaciones para otorgar mas oportunidades de mejorar a los alumnos.",
    "Dar un tiempo establecido para la realización de ejercicios en clases  para así estimar el tiempo demorado en su realización",
    "Ayudantes comprometidos y de calidadnbsp",
    "Podría mejorar la forma en que da a conocer la materia dedicando más tiempo a algunos contenidos.",
    "Todo se realizó de buena manera.",
    "Puede mejorar la demora de la entrega de las notas y de ser mas claro en las explicaciones no leer tanto las diapositivas.",
    "Enseñar mas formas de como aprender a programarnbsp",
    "ejerciciospor eso fue tan alta la reprobacion",
    "Se podrían destinar clases de ejercitación mas que solo hacer una presentación.",
    "por parte de andres rice mejorar su trato hacia los estudiantes",
    "Mejorar la claridad en las pautas al corregir una prueba",
    "objetividad y preguntas coherentes con respecto a las presentaciones orales al momento de evaluar.nbsp",
    "podría optar por hacer clases sin ppt",
    "El profesor Rice podria ser un poco mas compasivo a la hora de revisar.",
    "divprofesor me hubiese gustado verlo usar python ) divno trabajar solo con (.txt)",
    "Que en las clases también se le de tiempo para la ejercitación de problemas y explicar paso a paso el desarrollo de éstos.",
    "Las preguntas no claras a veces incomodan a las personas.",
    "Como profesor poco amable y no es claro al momento de corregir. Como persona Horrible. Nada empático y profesional.",
    "No enseña formas de abordar ejercicios de tipo prueba se guía mucho de los PowerPoint del curso solamente explica lo que hay en ellos y explica lo básico de la materia a pasar",
    "NO REALIZABA EJERCICIOS solo realizaba el power point y se iba y en mi opinion no es suficientenbsp",
    "Enfocarnos más en los ejercicios que del contenido.",
    "los proyectos del laboratorio en muchos casos son muy exigentes y creo que la coordinación debería evaluar la dificultad de los proyectos antes de plantearlos y ver si van acorde con el curso.",
    "centrarse más en la parte logica (creación de algoritmos) que la computación y programación como tal",
    "Realizar mas ejercicios en clase.",
    "Quizá debería ejercitar más la materia",
    "La modalidad en que se realizan los test ya que no siempre alcanza el tiempo para resolverlos o no se visualizan correctamente",
    "Que fuera en el lab la cátedra ya que así podríamos practicar de mejor forma los códigos junto con el profesor.",
    "Creo que se deberia mejorar el curso en el ámbito de laboratorio ya que los proyectos propuesto no están bien equilibrados para todo el curso deberían implementarse cosas mas interesantes.",
    "Los ayudantes debiesen destinar un horario aparte en vez de asistir a la clase.",
    "el desarrollo de guías con solucionarios  este ramo es muy complejo  asi que si pudiesen mejorar este aspecto podria ayudar mucho a los alumnos futurosnbsp",
    "la materia que respecta a este la creo innecesaria ya que es basica e inutilizable hoy en dia",
    "habla demaciado rapidonbsp",
    "De que el departamento de informática debería tener un libro como en las demás asignatura en el cual sea enfocado en Python en que contenga ejercicios materia etc",
    "En los laboratorios podrían enseñar a programar puesto que se realizan muchos trabajos de informes y disertaciones pero no se programa tanto como se espera (en los laboratorios)",
    "No hay nada que mejorar",
    "No tengo aspectos negativos a destacar es un muy buen profesor",
    "La manera en la que se explica la materia. ",
    "novato para el cargo.",
    "El profesor frecuentemente se mostraba nervioso en el aula y no explicaba con mucha claridad",
    "No se ve seguro de las cosas que explica y le tiembla la voz al momento de pasar la materia.",
    "mucha inseguridad se enrreda solo al momento de explicar",
    "Mayor claridad a la hora de entregar los contenidos",
    "No sabe explicarse en forma clara se enreda él mismo.nbsp",
    "El curso como tal está bien pero el profesor era demasiado nervioso y asumía que todos sabían la materia",
    "Aunque los contenidos del curso no se explicaron demasiado bien. Es fácil notar que es debido a una falta de experiencia. A medida de que continúe en el rubro las clases serán más dinámicas.",
    "Es necesario otorgarle mas recursos a los profesores para utilizar su verdadero potencial",
    "No le entendia muy bien ya que tartamudea cuando se pone nervioso y en ocasiones habla muy rapido",
    "las notas obtenidas en los quiz deberian estar publicadas de forma activa.",
    "Mayor confianza en el desarrollo de la clase.",
    "mayor seguridad y control sobre los estudiantes pues si bien es un profesor muy bueno se me sobrepasado por los ruidos y alumnos desordenados que le impiden pasar todos los contenidosnbsp",
    "explicar de forma mas clara la materia ya que para algunos es algo totalmente nuevo",
    "se debería explicar mas detalladamente los códigos vistos en clases  y de que manera son las estructuras correctas de estosdiv",
    "Cambiar el dia de las pruebas ya que el dia sabado no todos disponen de tiempo para rendir una prueba",
    "Es muy rajón a la hora de corregirnbsp",
    "Nada que decir al respecto.",
    "La forma de enseñar. El como impartir la clase.",
    "No se dan textos de apoyo claros para estudiar.",
    "En la cátedra se podrían realizar ejercicios similares a las peps del correspondiente año.",
    "Mejorar la eficiencia respecto a la densidad de la materia durante el transcurso del semestre.divRevisión de pruebas sujeta a la subjetividad.",
    "Se debe evaluar el sistema de corrección de pruebas del profesor ya que no es posible que en su curso hayan pasado 4 alumnos de 52 es decir un 7.7. En otros cursos aumenta considerablemente.",
    "que las pep no sean imposibles",
    "Criterio de evaluación en cátedra.",
    "Lo que encuentro extremadamente deficiente en esta asignatura son las evaluaciones en esta asignatura acerca de escribir un codgo no necesariamente ponen a prueba los conocmientos del estudiante.",
    "mas apoyo con material y ayudantiasnbsp",
    "se deberia trabajar mas con python directamente para asi ser mas facil poder programar",
    "que las clases no sea tan monotonas.",
    "En el caso del laboratorio se pacto de palabra posponer una presentación luego el acuerdo se desconoció por parte de la profesora. Conclusion todo respaldado en correos.nbsp",
    "El lab de esta materia podria considerarse un ramo aparte  la cantidad de horas que hay que dedicarle es demasiada.",
    "en como pasaba la materia porque no entendi nada",
    "Puede que maneje los contenido de forma clara pero no los comunica de la misma forma. Debería utilizar mas el data para explicar los programas con python",
    "EL laboratorio Como en 200 caracteres no puedo expresar mi opinión le haré llegar a los dos coordinadores mediante correo lo que siento se puede mejorar en la asignatura.",
    "Las evaluaciones no son para un curso de fundamentos considero que el nivel del exigencia que solicitan no es para un curso donde uno aprende a programar.",
    "divLa forma de trabajo del LABORATORIO. Esperaba que por ejemplo se nos enseñara a usar Python usando de buena forma los recursos tecnologicos.",
    "demasiado crítico a veces",
    "entender que no todos vemos las cosas como el (por la experencia que tiene obiamente le es facil ver ciertas cosas) y entregar las pruebas mas rapido",
    "son muy perfeccionistas y no dan oportunidad a equivocarse",
    "Se podría mejorar el laboratorio de FCyP creando nuevos programas cada clase en vez de uno solo en todo el semestre",
    "En el ambito del laboratorio tener computadores óptimos para cada alumno",
    "se debe mejorar la calidad de profesores (bryan) tiene muy mala disposición mejor se dedica a ser alumno en vez de profesornbsp",
    "Fomentar el pensamiento de que la programación realmente es útil para los ingenieros.",
    "nada todo esta bien",
    "El profesor de laboratorio evalua de mala manera ya que da consejos o corrige cosas que estan bien induciendo mas al error que al entendimiento.",
    "El profesor de laboratorio nunca hizo una clase solo vigilaba para los quizzes a mi en lo personal el ayudante fue quien ayudo en el desarrollo del proyecto.",
    "en laboratorio la evaluacion de trabajos se fija en muchos detalles como ortogradfia y deberia fijarse mas en el dominio de contenidos",
    "Encuentro que el desarrollo de la asignatura fue optimanbsp",
    "mejor trato con alumnos",
    "nada que agregar",
    "la poca disposición de algunos ayudantes (laboratorio) y de los profesores (ambos) para ayudar a los estudiantes a desenvolverse y a entender dan por echo de que uno debería entender como ellos.",
    "Más ejercitación tipo PEP y menos teoría.",
    "a mi parecer nbspfue muy buena la manera de explicar",
    "No tiene puntos débiles.",
    "no hay sugerencias",
    "Ningun aspecto negativo",
    "Podría revisar las pep con menos estructura de pauta ya que no se puede con 1hr y 30 min hacer 2 o 3 programas tan como la pauta. También podría h",
    "podrían mejorar la enseñanza ya que se nota demasiado que quienes imparten las clases tienen cero vocacion como docente y son sencillamente ingenieros impartiendo clases.",
    "Señalar los pequeños detalles que diferencian las funciones de otras.",
    "mejorar la brecha que existe entre clases y evaluaciones son algo muy alejados entre si y creo que es el problema por la gran cantidad de reprobados cada semestre",
    "Se podria mejorar el sistema en que enseñan el ramo a base de solo ppt no se avanza mucho.",
    "que si alguien no entiende que tengas múltiples manera de explicar y no solo de 1 nbsp",
    "divMejorar en cuanto a su orden.",
    "Podría ser más accesible hacer consultas fuera de clases y explicar bien la forma como se nos evaluará ya que hay criterios que no se practican en clases.nbsp",
    "La asignatura debería entregar mas herramientas a los estudiantes (materia) ya que en las pruebas se pregunta mas de lo pasado en claes.",
    "no mejoraria nadanbsp",
    "no desarrolla los ejercicios que hace en clases por lo que uno queda con la duda de como seria la respuesta del ejercicio.",
    "Encuentro que la asignatura esta bien como esta.",
    "talleres abocados al desarrollo de problemas asociados a los contenidos.",
    "optar por un lenguaje más amigable para el alumno no tan técnico",
    "no hay fallos.",
    "Explicar los contenidos con mejor claridad y no tan rápido",
    "El laboratorio está mal estructurado. A mi entender el laboratorio debería de ser la instancia en la que se practican los contenidos vistos en clases cosa que nunca ocurre.",
    "la forma de explicar el contenido",
    "Las clases en teoría deberían de ser como las de laboratorio así podriamos ver los errores que se nos presentan en la programacion.",
    "hace falta apoyo u orientar a los ayudantes como es la forma mas adecuada de estudiar este ramo ya que su metodologia es muy distinta a todos los demas",
    "considero que el curso esta muy mal impartido es dificil aprender de la forma en que se enseña podria mejorar",
    "usar menos los ppt y hacer una clase mas preparada",
    "podría mejorar el método de enseñanza ya que el profesor era un poco inseguro al momento de enseñarnos y la forma en como aprendemos a programar no es muy didactica",
    "Solamente escribir un poco más claro...",
    "Se ignora a veces que hay estudiantes con muy poca experiencia en programación y no se nivela en ese sentido.",
    "nada que decir.",
    "nada que acotar",
    "Que hable mas fluido",
    "podria mejorar en entregar tips para la resolucion de ajercicios la verdad no mucho ya que se entregan todas las herramientas para el desarrolo de la asignatura.",
    "Distribuir de mejor manera el tiempo cosa de que se pueda ejercitar más en cada clase",
    "Referente a la entrega de notas para cada evaluación se tenía la incertidumbre de no saber qué pasaba con la nota de cada uno",
    "Podría realizar ejercicios en conjunto con los alumnos y no esperar a que los alumnos los hagan para luego decir si esta correcto o no ya que a mi parecer se irían aclarando de inmediato las dudas.",
    "podria mejorar la puntualidad",
    "Explicar de otra manera la materia dar ejemplos distintos a los que salen en los ppt de las clases.nbspdivRealizar ayudantías serían muy útil para ejercitar.",
    "Aprovechar el tiempo de sobra para realizar el desarrollo completo de varios ejercicios de la asignatura.",
    "que el ayudante sea mas participativo",
    "mas uso de python el clases .",
    "mayor variedad e ejercicios resueltos para la preparacion de las evaluacione.",
    "el profesor debería aprender a leer bien.",
    "se retrasa a la hora de llegada de la clase. No responde siempre los mails",
    "trata muy a la ligera el ramo",
    "Ayudantías fuera de la hora de clases",
    "divNada que agregar.",
    "explicar mejor la base de los contenidos",
    "Debería realizar mas ejercicios pero solamente eso.",
    "Debe ser más claro para explicardivNo debe enredarse en sus explicaciones pués enredan a los alumnos también",
    "Mejorar los métodos para la concentración del alumno crear otro método de explicar cosa de entender bien la materia",
    "Es un irresponsable una ridiculez que nadie haga algo. Ahí se nota la revisión de la coordinación. Otro aspecto que deja mucho que desear en la universidad y que ha pasado en otros ramos.",
    "Para alumnos a los que la materia no se les daba tan fácilmente el profesor no enseñaba de la mejor forma.",
    "La asignatura se podría relacionar más con la carrera.",
    "Que haya mas comunicacion entre profesor y estudiante",
    "En cátedra se debería mejorar en gran medida el criterio de evaluación del profesor y también mejorar la forma de enseñanza ya que la comprensión de esta era casi nula.",
    "En cátedra seria bueno que el profesor tuviese mayor disponibilidad a atender las consultas y no me parece bueno que en cátedra se evalúe parte del laboratorio.En laboratorio todo me parece bien.",
    "trabajar mas en computadores ya que el estudiante solo aprenderá los conceptos durante el semestre pero no la técnica.",
    "Podría volver las clases un poco más dinámicas.",
    "Podrian mejorar el estilo o manera de desarrollar las pruebas",
    "No resuelve dudas de manera clara",
    "el metodo de las pruebas",
    "Mejorar el plazo de entrega de evaluaciones. Faltó mayor claridad en el desarrollo de ejercicios.",
    "que sea mas didactico a la hora de enseñar",
    "Se podría mejorar el intercambio de información de ejercicios por ejemplo.",
    "Debería ser más práctico asi como en el laboratorio ya que el programa teórico y la forma de las evaluaciones son innecesarias para la realizacion o aprendizaje de la asignatura.",
    "Podría ser más dinámico en las clases.",
    "Nivel de ejercitacion MUY lejos de lo preguntado en pruebas se solivcita mayor nivel en la ejercitación.",
    "ser mas lento",
    "mayor entrega material resumido",
    "la impuntualidad en la entrega de notas",
    "dar mas confianza para resolver las dudas",
    "En el grupo de trabajo del proyecto nbspno siempre todos tienen la misma intención de realizar el proyecto y por lo tanto perjudican a los que tienen la mejor intención.",
    "Juan Gonzales Reyes es un muy mal profesor altanero y desagradable. Se puede mejorar partiendo por cambiarlo",
    "la profe de ejercicios",
    "ir mas a clases",
    "la calidad de los pptdivla disposicion del profesornbspdivla relacion profesor alumnonbspdiv",
    "No quiere enseñarnos simplemente mostrar que el sabe más que nosotros engreído y petulante con complejos de superioridad no sé porque hace clases aquí.",
    "la demora en la entrega de las evaluaciones",
    "Se podrían dar mas tareas de ejercicios para la casa para poder ejercitar de manera mas eficiente la resolución de problemas.",
    "Un profesor mas dedicado a la universidad y que tuviera los dotes de pedagogonbsp",
    "falta de ayuda con ejercicios teniamos pocos recursos para estudiar",
    "Más horas de clases.",
    "El plazo con el que se entregan las notas.",
    "deberia mejorar un tanto en la parte practica no todos hacian los ejercicios que el proponian seria mejor que realizara ejercicios algunas clases y no solo dejarlos propuestos",
    "No se termino de pasar la materia y se hacían ejervicios de lo mismo en cada clase lo que impedía aún más continuar",
    "Podria ser mas claro al momento de explicar cada parte de los ejercicios junto con las codificaciones",
    "cambiar los profesores",
    "llega muy tarde y la forma de revisar las evaluaciones",
    "Nada me encanta",
    "deberian ser mas practicos a la hora de enseñar ser consistentes y enseñar lo que realmente se puede utilizar ayudar a los alumnos y no estropearlos.",
    "la forma de enseñanza",
    "demaciado pautero nbspal corregir evaluaciones",
    "Considero que la asignatura no tenía la misma exigencia en todas las secciones. Debería existir una forma de control para que todos los miembros del equipo en el laboratorio trabajen lo mismo",
    "se podria borrar un quiz",
    "Era bastante dificil hablar con el profesor solo por su actitud tan desagradable",
    "Establecer un poco mas de tiempo al curso ya que tiene bastante dificultad",
    "una relación deficiente con los alumnos y cuando se le consulta algo la respuesta nunca es clara.",
    "Ayudantes del ramo serian bastante utiles dado la complejidad de este",
    "faltaron clases para resolver ejercicios muchos feriados",
    "Cambio en el desarrollo del laboratorio con los quizes incluidos creo que no están orientados en que el alumno aprenda.",
    "criterio de evaluacion",
    "Que los profesores en general dejen nbspun poco el orgullo y que se acuerden que también fueron alumnos eso podria ayuda a mejorar el trato profesoralumno",
    "El profesor esta bien calificado y no creo que deba mejorar algo porque su metodo es muy eficiente.",
    "dinamica de clases",
    "fome demanda mucho tiempo",
    "Me da la impresión de que responde de manera defensiva.",
    "no corrige bien las pruebas",
    "Fallo en explicar ciertas materias.",
    "si las pruebas se realizaran en el computador al igual que los quizzes seria mejor también seria bueno que en el laboratorio mas que enfocarse en el proyecto final se ejercitara lo visto en clases",
    "Mejorar sistemas de grupos además de hacer ayudar al manejo de equipo ya que se ve mucho en temas de laboratorio que no todos trabajan y trae problemas.nbsp",
    "Reprobé el laboratorio porque según los profesores el trabajo no era acorde a un alumno de primer año por lo bien que estaba realizadoademás no se me dio oportunidad de poder apelar.nbsp",
    "que hayan ayudantias en este ramo donde se resuelvan ejercicios tipo pep",
    "La calidad de los implementos (Proyector etc) al momento de afrontar la catedra",
    "Sea mas estricto.",
    "Agregar otro mecanismo de control. ejemplo controles en clases",
    "Hacerla más didáctica. Utilizar más medios en cátedra ya que con solo leer no se aprende a programar.nbsp",
    "no lo sé... nada",
    "hacer ejercicios en la pizzarra y no en grupo",
    "Clases de ejercicios resueltos ya que es un lenguaje nuevo que se enseña y donde cuesta tener el pensamiento lógico para resolver los diversos ejercicios.",
    "divDetallar el funcionamiento de algunas funciones mas generalmente en que tipo de programas puede servir",
    "Mejorar el material para pasar los contenidos.",
    "En las clases de laboratorio usar los computadores para nbsprepasar lo visto en las clases teóricas para ayudar a las personas más ajenas a la computación.",
    "Que los PPT no tengan faltas de ortografía.",
    "no hay mucho en que podría mejorar",
    "mas formalidad y mayor explicación de la materia.",
    "ejercicios con mayor dificultad para contextualizar el ramo",
    "el tema de los quizzes",
    "Entregar mas guias de ejercicio o textos de apoyo.",
    "mejorar el metodo de enseñanza porque esto afecta a muchos estudiantes",
    "las cases de laboratorios deberían ser mas efectivas a mi parecer no era posible crear un programa con los contenidos que en las clases entregaban debido a que eran casi nulos.",
    "subir mas material para el estudio",
    "Ningun aspecto a mejorar segun mi punto de vistanbsp",
    "Que en el laboratorio realmente se trabaje con python o el lenguaje que sea pero que se trabaje",
    "Sólo una revisión más rápida de las evaluaciones.",
    "Realizar más clases de ejercicios",
    "podria mejorar dando libros de referencia para los alumnos menos aplicados para que puedan estudiar másnbsp",
    "nada que mejorar",
    "Irene ser mas especifica con lo que va a evaluar",
    "creo que faltan horas de laboratorio para poder realizar los proyectos en conjunto con el ayudante y/o profesor ya que el alumno jamas va a tener el 100 de los conocimientos de python",
    "Se deberían desarrollar con frecuencia ejercicios simple y otros complejos durante la clase.",
    "Con los quizz siempre hubo problemas técnicos el internet se caía no tomaba bien una respuesta etc.",
    "Apoyarse mas con un libro.",
    "Tal vez la falta de entregar recursos bibliográfico.",
    "El laboratorio debe tener proyectos que sean coherentes con lo desarrollado en cátedra muchas propuestas de proyectos solo podían ser realizadas al final del semestre.",
    "No basarse tanto en algunas ocasiones de ejercicios ya vistos si no innovar con nuevos ejercicios y explicar el por qué de esa forma y otras maneras también de abarcarlos.",
    "Profesor de teoría. Una vez enseñado lo básico avanzar a lo más difícil. Profesora de laboratorio. Utilizar mejor el tiempo en el laboratorio enseñandonos mejor a p",
    "que se evalue con menos rigidez el ramo ya que no todos tienen la habilidad computacional.",
    "Ricardo Corbinaud se queda dormido en clases tratar de decirle que descanse mas es un excelente profesor sacando este aspecto.",
    "Lo mismo para todos. Que los alumnos pongan mas de si mismos",
    "era un poco flojo",
    "pruebas deberían ser en computador ya que ahi se ve realmente si uno sabe programar y lo pone en práctica",
    "cátedra hacer más ejerciciosdivlab preocuparse más por el real desarrollo del proyecto y no ser tan duro con las criticas (Siempre nos decia que hacíamos mal las cosas)"
  ]
}
