{
  "positivos": [
    "Es muy didáctico y sus clases son interesantes y entretenidas.",
    "La clase teórica es muy eficiente entregando contenidos y poniendolos en practica.",
    "La asignatura cubre conceptos que son a mi parecer sumamente importantes en la actualidad. El profesor explica con claridad es transparente justo y buen observador.",
    "El profesor se maneja muy bien con el tema es bueno para explicar se le entiende bien y a los temas que son mas difíciles le dedica mas tiempo.",
    "Siempre era claro al explicar hacia ejercicios que servian para las pruebas nos daba buenos tips y consejos.",
    "dinamismo por parte del profesor",
    "logra ejercitar bastante en clases para preparar lo mas posible en cualquier escenario.",
    "Es un ramo que genera el desarrollar mucho el ingenio un ramo bastante entretenido e importante para empezar a ir cambiando la forma de pensar que se tienen antes de entrar a la U.",
    "Uso de recursos para facilitar el curso.",
    "hace ejercicio de preparacin antes de las pruebas",
    "Se explica muy claramente los contenidos dando muestra de la teoría mediante ejercicios en clases. Se preocupa del aprendizaje de los estudiantes",
    "La asigantura te permite conocer una nueva forma de pensar conocimientos que pueden ser usados en cualquier area y ensela que la relacion profesoralumno es importante",
    "voluntad de enseñar",
    "Las conocimientos que nos provee la asignaturanbsp",
    "Al ser un profesor novato fue muy efectiva su forma de aprendizaje.",
    "Buena disposición por parte de los profesores. Buena forma de enseñar.",
    "la cerecania del profesor con los alumnos",
    "Ambos profesores estaban abiertos a consultas tanto por correo como presencial.",
    "Muy buenos profesores ambos.",
    "Disposición a responder dudas.",
    "Lo que tenía bueno el curso fue el profesor de laboratorio que siempre tuvo la dedicación de ayudar.divEl profesor de cátedra era ordenado en la planificacion que existia.nbsp",
    "la clase era agradable y el profe tenia buena voluntad para enseñarnbsp",
    "Lo positivo que tiene es que en las evaluaciones independiente si está bueno o no el programa se dedica a ver las intenciones y la coherencia que los estudiantes ponen en ellas",
    "El profesor pasó los contenidos en su totalidad.",
    "Habia bastante disposición de los profesores ante todo tanto los profesores de teoría y de laboratorio entregaban eran bastante completos en la hora de enseñar",
    "capacidad de abstraccion y solucion de problemasnbsp",
    "buena disposicion tanto dentro como fuera de clases nbsp",
    "Incitar a aprender a programar independiente de la carrera que siga el alumno",
    "encuesta respondida considerando al profesro victor araya. el profesor andres rice no es el mejor ni el peor",
    "es muy amable en la recorrección de las evaluaciones ademas entregaba ejercicios tipo prueba",
    "profesores muy buenos en su area ordenados y claros al momento de explicar ademas se toman el tiempo necesario para aclarar dudas y propician un buen ambiente con los alumnos",
    "Muy buen profesor de catedra facil de entender se toma el tiempo necesario en que todos sus alumnos entiendan.",
    "el profesor explica muy bien y se preocupa de dejar las dudas resueltas antes que la clase termine.",
    "La inclusión de una plataforma online para poder repasar contenidos vistos en clases.",
    "Excelente en la teoría.",
    "Muy buen profesor con un buen enfoque a la materia como tal buscando la creción de algoritmos",
    "Profesor muy dispuesto a ayudar en el proceso de aprendizaje",
    "Existía harta práctica de los ejercicios.",
    "buena disposicion para atender consultas",
    "El curso me pareció bastante bueno aprendí mucho y desarrolle una nueva habilidad por el lado de la programación el profe excelente siempre nos enseño todo con buena voluntad y simpatía.",
    "La plataforma virtual era muy práctica para el estudio.",
    "Generó un ambiente de confianza en clases lo que permitía aprender de manera más óptima",
    "Excelente equilibrio materiaejercitacion.Además pasa la materia de forma clara )",
    "considero que este ramo se deberia impartir solamente a las personas que se especializan en informatica",
    "Que exista un laboratorio a disposición del alumnado para poder desarrollar nuestro trabajo",
    "profesor cercano roberto sandoval. buena disposicionnbsp",
    "buena disposición de los profesoresdivconocimiento completo y buena manera de enseñarlodivmotivacion y empatia",
    "que pruogramaramo/uus en conjunto  con i/udeuas /udue él ynbsp /uu de no/uusotro/uus/u",
    "la plataforma moodle sirve mucho  ya que se encuentra toda la info alli",
    "Clases didacticas excelente profesor",
    "Básicamente los profesores de Cátedra y laboratorio siempre tuvieron una máxima disposición para enseñar y siempre fomentando el estudio y la practica",
    "Aprovecha de buena manera la tecnologia para hacer sus clases.",
    "Era accesible al momento de realizar consultas y buena voluntad al responderlas ademas los ejemplos hechos en clases ayudaban a comprender mejor la materia.",
    "que ocupa power.",
    "Buena disposicion del profesor.",
    "Buen material en U de Santiago virtual",
    "El profesar muestra amplia disposición para asistir a los alumnos fuera del horario de clases",
    "Siempre buena disposición.",
    "es un profesor muy buen nbspprofesor y hace de forma grata las clasesnbsp",
    "hace muchos ejercicios y manda las soluciones bien explicadas manda todo el material corrige objetivamente las pruebas",
    "Muy buena disposición frente a consultas se nota que le importa que aprendamos",
    "Ambos profesores de teoría y laboratorio tienen gran disposición a ayudar a sus alumnos siendo comprensivos con sus errores y complicaciones.",
    "El tema de las ponderaciones de las evaluaciones",
    "Buena disposicion a responder dudas.",
    "El curso lo encuentro bastante bueno y útil aunque hay aspectos como matplotlib que encuentro innecesarios",
    "Puntualidad un buen criterio a la hora de evaluar las presentaciones.",
    "se responden a la brevedad las consultas hechas hacia el profesor ya sea presencialmente o via correo",
    "Todas estas respuestas son por el profesor Benjamin el cual realizó el laboratorio.",
    "El profesor de teoria es muy esforzado en la explicacion de las materias el profesor de laboratorio explico perfectamente y siempre estuvo atento de las inquietudes de sus estudiantes.",
    "Excelente enseñanza y disponibilidad del profesor además de las facilidades que nos dieron virtualmente con videos.",
    "Profesor planificado y bien cuando debe explicar",
    "Preocupado en hacer entender la materia a los alumnos",
    "Asignatura muy util el profesor explica claramente.",
    "Accesibilidad a dudas de estudiantes en cátedra y laboratorio recursos extras utilizados. Retroalimentación y criterio de evaluacion claro en laboratorio.div",
    "El laboratorio prepara bien al estudiante para trabajar en equipo.",
    "Mas que un aspecto positivo seria bueno que se informaran los nombres de los profesores en la inscripción de ramos.",
    "En general  es una asignatura interesante que favorece a la abstraccion de problemas que es un habilidad inportante enn la ingenieria.",
    "es un ramo distinto a todos los demasnbsp",
    "Entrega información y realizan actividades que permiten desarrollar el curso de buena manera",
    "Fue un profesor que manejaba de forma clara el contenido",
    "buena explicacion de ejercicios trabajando en la pizarra",
    "que hacia varios ejercicios",
    "Nos ayudo a potenciar nuestro nivel de investigacion en la creación de nuestro proyecto en laboratorio.",
    "Buen profesor Y profesora",
    "es un ramo mas didactico y a la vez efectivo",
    "explica bien los contenidos y hace harto ejercicio",
    "Las clases teóricas",
    "Es divertido programar",
    "profesor cercano a sus alumnos",
    "divLa constante ejercitacion realizando controles y dando tareas",
    "explica las cosas de mas de una forma con el objetivo de que todos aprendan y entiendan",
    "El profesor de cátedra hace una de las clases mas divertidas que he presenciado.",
    "Excelente profesor explica muy bien mantiene atentos a los alumnos crea un ambiente que se puede preguntar sin problemas y motiva al estudio del estudiante.",
    "Considero positivo la buena disposición del profesor para enseñar y resolver dudas como también las presentaciones",
    "Buena metodología utilizada para enseñar la materiadivBuenas herramientas para poder resolver los ejercicios.",
    "disposición de los profesores para responder dudas.",
    "Pedagógico para explicar el contenido buena disposición sus clases son muy agradables puntual.",
    "explica de forma clara y es objetivo al momento de evaluar",
    "muy interesante la asignaturanbsp",
    "El profesor de catedra tiene mucha paciencia y enseña de tal manera que la materia sea facil de entender aparte de estar dispuesto a responder dudas.",
    "El tema de tener una plataforma en la cual había buen material de apoyo para el estudiante",
    "francisco acuña es excelente profesor aprendí tiene una muy buena pedagogía bryan se debe dedicar mas a enseñar que rajar a sus alumnos nbsp",
    "Tras cada contenido visto habían clases dedicadas al trabajo y ejercicios de los contenidos vistos que ayudaban a la comprensión de estos.",
    "Es entretenidalamentablemente cursaba una depresión.",
    "muy didacticodivbuen tratonbspdivmuy puntual con los horarios",
    "nada que agregar",
    "se realizan ejercicios de todo tiop se resuelven dudas durante y despues del horario de clases ademas se entrega material de apoyo y ejercicios de desafios",
    "Excelente profesor explica de manera clara y detallada es preocupado por el aprendizaje de todos y se esfuerza por sacar adelante su asignatura.",
    "la entrega de material de apoyo como guias es fundamental ademas el hecho de hacer mini controles para irse midiendo es una herramienta excelentenbsp",
    "se realizaron bastantes ejercicios lo que ayudo a entender mejor la materia",
    "Muy buen profesor se le entiende la materia cercano con sus alumnos y amable abierto a dudas y muy buenas respuestas a la brevedad",
    "llega muy puntual a sus clases.",
    "sus clases eran didácticas y muy entretenidas",
    "La oportunidad de trabajar en el laboratorio permite contextualizar el aprendizaje adquirido en clases ademas de potenciar la organización para sacar adelante proyectos",
    "La profesora es sumamente clara en explicar ademas de tener siempre un grado de cordialidad con el alumno razones por la cual la materia se entiende mas facil.",
    "Clases muy didácticas especialmente conceptuales para entender lo abstracto de las clases.",
    "las clases eran muy didacticas lo que hacia que uno se de desconectara de la clase",
    "La profesora se manifiesta de forma adecuada ya sea en el interés por que sus alumnos aprendan.",
    "A pesar de la complejidad de la materia logran presentarlos bien y de forma ordenada.",
    "La forma de explicar del profesor",
    "el mejorar la capacidad de resolución de problemas.divfomentar el trabajo en grupo.",
    "muy buenos profesoresnbsp",
    "buena relacion interpersonal con el alumno",
    "explica bien  de forma clara",
    "profesores siempre presentes.",
    "Muy buena clase el uso de elementos tecnológicos en el aula favorece el desarrollo de la asignatura",
    "Las clases en el laboratorio son lo mejor que tiene este ramo debido a que son mas practicas.",
    "las disposición del profesor con respecto a nosotros siempre con la intencion de que aprendamos",
    "Ambos son profesores excelentes en sus asignaturas",
    "Muy accesibles a la hora de resolver dudas tanto el profesor de catedra y laboratorio",
    "buena disposición para resolver dudasnbsp",
    "Claro y conciso para explicar los contenidosdiv",
    "Muy buen ramo.",
    "Profesor con buena disposición para responder dudas en cualquier medio.",
    "Es cercano a los alumnos lo que hace facil preguntarle dudas.",
    "En cada clase de realizan ejercicios correspondientes al contenido que se ve en ese instante",
    "excelente profesor los aspectos positivos fueron que el profesor utilizara su computador para mostrar ejemplos en el programa de que cosas hace y que no haces.",
    "daba espacios para hacer consultas sobre la materia",
    "que existe variado material",
    "el ayudante y el profe era bueno",
    "Trata de facilitar la comprensión de los contenidos vistos a lo largo del semestre",
    "Las dudas desarrolladas en clases eran satifactoriamente respondidas durante el desarrollo de esta.",
    "Ayudaba en la formación de un ambiente de buena onda en las clases con continuos ejemplos que ayudaban a comprender la materia",
    "Ambos excelentes profesores. Dispuestos a brindar ayuda en todo momento.",
    "El espacio y libertad de expresión que se nos entrega en estas encuestas pone en duda el verdadero interés en conocer nuestras opiniones y más aún el que se lean.",
    "buen trato con los estudiantes",
    "Es fácil entablar una conversación con él.",
    "Buen profesor enseña bien a su manera.",
    "Se notaba que el profesor tenía experiencia al hablar de la industria en la que se aplican los contenidos y estuvo siempre abierto a explicar de la mejor forma la materia.",
    "Tiende a tener una relacion mas cercana con los estudiantes",
    "Buen animo y buena dispocision",
    "Los contenidos vistos en cátedra so utilizados en el proyecto de laboratorio así se logra internalizar la materia.",
    "Harta programacion en vivo.",
    "Explica con el programa ayudando asi al estudiante tener una vision mas clara del programa y las herramientas que uno puede usar",
    "Muy buena profesora de laboratorio excelente forma de enseñanza.",
    "Fue un ramo interesante.",
    "el ambiente de curso",
    "Hace bastantes ejercicios y tiene buena disponibilidad para con los estudiantes.",
    "Excelentes clases cada contenido con su respectivo ejemplo y varios ejercicios nbspque eran corregidos dentro nbspdel horario de clasesbuena disponibilidad para ver errores que uno podía tener",
    "Desarrolla de manera clara los contenidos en clases además de ir paso a paso en el proceso de programación como tal.nbsp",
    "Era responsable en cuando a los horarios de clase y también asistía dudas después de clases.",
    "Nos da una herramiente que puede o no ser necesariaen un futuro.",
    "los profesores resolvían dudas y en cátedra siempre se realizaban ejercicios luego de pasar la teoría.",
    "Uso de power point en clases",
    "el profe de teoria",
    "respeto al momento de enseñar por parte del profesor",
    "daba mucho material de apoyo para ejercitar y así nos fuese bien en las evaluaciones",
    "El profesor de laboratorio fue muy amable fue una grata experiencia",
    "este laboratorio me hizo desarrollar mejor las actividades grupales",
    "Buena llegada con el alumnado (roberto sandoval)",
    "sabe explicar el contenido y se entiende",
    "excelentes clasesbien guiadas con presentaciones y ejemplos en clases",
    "El profesor explica de manera clara los contenidos de la asignatura y nos retroalimenta con las evaluaciones dándonos a conocer nuestros errores",
    "la cantidad de material con el que se contaba",
    "El ayudante fue lo mejor tuvo nbspuna disponibilidad excelente ademas que asistió a todas las clases por lo cual conocía que habíamos visto en clases y nos ayudo en todo lo posiblenbsp",
    "siempre dispuesto a dudas y consultas de los alumnos ademas de llegar con todas las ganas de enseñar a clases",
    "Explica de forma simple la materia",
    "Explica bien siempre esta atento a las dudas y siempre tiene disposición a resolverlas a la hora que sea.nbsp",
    "buen profesor enseña muy bien ",
    "intenta explicar biendiv",
    "lo positivo es aprender a programar",
    "Profesor con buena disposicion",
    "Logro explicar la materia ademas de la lógica de programación dando a entender el contexto del lenguaje enseñado.",
    "Todo muy bien explicado solo era necesario el estudio propio y el ramo se podia pasar facilmente",
    "muy interactivo creativo etc",
    "Es ramo que permite desarrollar el pensamiento lógico y el ingenio para poder sobrellevarlo",
    "Buen profesor y su metodo de sacar alumnos a realizar ejercicios me parece bastante bueno.",
    "Ramo muy divertido e interesante que ayuda a comprender el funcionamiento y la utilidad de Python en los diversos ámbitos de la ingeniería y vida cotidiana.",
    "se ocupa el pc",
    "envio de guias",
    "enseñansa clara y al grano",
    "Su exigencia logro que aprendiera de mejor manera la materia.",
    "Excelente manejo de teoría y actividades desarrollo de preguntas y además tener espacio para preguntas personales.",
    "fue un buen acercamiento a programacion ayuda a desarrollar el intelecto haciendo que el estudiante enfrente problemas con nuevas herramientas que no conocia",
    "explica de manera detalladanbsp",
    "el profesor manejaba muy bien el contenido del curso",
    "Grande Profe preocupado de la comprensión de cada uno de los alunos buena manera de pasar la materia y ejercitarnos.",
    "Agrega conocimiento adicional.",
    "Explica muy bien el contenido",
    "clase didáctica hubo mas práctica que teoría",
    "Buen profesor supo llevar a cabo bien cada contenido que pasó.",
    "Se da tiempo para atender dudas y consultas",
    "nbsprealiza ejercicios con los estudiantesse da el tiempo para resolver las dudas .",
    "El mejor profe explicaba con peras y manzanas. Resolvia todas las dudas  sus clases muy didacticas. Excelente profe y muy buen ayudante el que tenía.",
    "excelente el profe luis. reconozco que no tomé mucho en cuenta el ramo por mi irresponsabilidad pero sabe enseñar de forma clara.",
    "La actitud frente a los alumnos y la ayuda oportunamente brindadanbsp",
    "Es un ramo muy entretenido que en mi caso me sirve bastante. Nos abre la mente de como funciona el mundo informático.",
    "Muy dispuesto a atender a los alumnos personalmente o via correo.",
    "Ambos Profesores con muy buena disposicion al momento de antender consultas ademas de eplicar bien la materia.",
    "Los conocimientos del profesor y su buen trato con los alumnos favorecen un ambiente de estudio optimo para la asignatura.",
    "El profesor es muy directo para explicar los contenidos aún cuando a los alumnos nos cuesta mucho entender algún punto.div",
    "excelente profesor y muy buen guia durante el ramo",
    "Da ejemplos mientras pasa la materia.",
    "la pagina web de la asignatura.",
    "Trujillo excelente como profesor quizas no sea su area sabe explicar y enseñar, Orellana conoce la teoria de una forma increible",
    "Uno de los mejores profesores de la universidad fomenta el estudio enseña de forma clara ayuda a los estudiantes y tiene vocación",
    "en cátedra se entregan todos los recursos necesarios para desarrolar el ramo de manera eficiente.",
    "Por parte del profesor Trujillo mucha paciencia y dedicacion al momento de hacer sus clases",
    "buenísimo profesor puntual cordial y preparado.",
    "Su clase es muy didactica enseñando la materia y ejercitando en clases.",
    "Creo que la manera de enseñar del profesor ayuda mucho a comprender el como se debe trabajar un programa",
    "Excelentes ambos profesores. Buenos para atender dudas y ver distintas formas de abordar problemas. Clases agradables.",
    "El profesor explica de forma clara sus clases son didácticas está abierto a responder todas y cada una de las preguntas que se presenten. Muy buen profesor.",
    "El profesor de cátedra cada vez que iba abarcando materia iba mostrando ejemplos en el computador y eso era muy bueno pra comprender la materia",
    "Contextualización clara de los contenidos utilización de material tecnológico y buena disposición para resolver dudas.",
    "El profesor hace preguntas con frecuencia se participa en la clase y se hacen con frecuencia ejemplos con ejercicios de la materia.",
    "Su facilidad para dar a entender la logica y razonamiento necesarios para desarrollar el conocimiento del curso",
    "Realiza una clase bastante dinámica.",
    "El profesor de catedra explicaba muy bien además los ayudantes fueron muy útiles a la hora de responder dudas",
    "Ambos profesores muy buenos nbspexplican y enseñan bien tienen disposicion ante dudasnbsp",
    "Buen desarrollo de la clase en todos los aspectos considerando evaluacion y dinamica al impartir la materia",
    "es un buen profesor tiene una actitud muy favorable para la clase tiene un manejo completo de lo que enseña y es muy atento con los alumnos fisicamente y virtualmente por nbspcorreonbsp",
    "Explica bien sus clases con sus presentacionesentrega un analisis completo del pptexplica con python en su computadorun amor de profesor.",
    "Todo quedé conforme con el curso y con los excelentes profesores que me tocó.",
    "La herramientas que se entregan para poder aprender a programar mediante python eran lo suficientemente efectivas como para manejar rápidamente este lenguaje.",
    "Considero que este profesor transmite de alguna manera ganas de programar en este caso además de estar dispuesto a todas las dudas del alumnado.",
    "es una herramienta util para cualquier ingenieria",
    "Profesor de teoría. Enseña lo simple detalladamente para un mejor entendimiento. Evalúa bajo un buen criterio. Profesora de Laboratorio. Muy realista y objetiva al momento de explicar.",
    "se desarrollo bien la materia en si era entendible para el alumnado .",
    "buen profe simpatico siempre te ayuda hacia varios ejercisios y daba varias ayudas",
    "Es algo totalmente nuevo para mi y me llamo mucho la atención lo de programar. hizo que me sintiera realizada cuando me salía bien un programa que habia hecho yo mismanbsp",
    "Era divertida la manera en que el profesor de cátedra explicaba la materia por lo que yo aprendía más rápido.",
    "buena disposición de los profesores a contestar dudas",
    "cátedra se explican los contenidos de una forma muy sencilla que se hace fácil entenderdivlab el profesor es bastante ordenado",
    "Muy buenos profesores el de Cátedra revisa muy bien las pruebas.divPor otra parte Oyarzún es muy bueno enseñando y aplicando revisiones enseña bastante como deben ser las presentaciones",
    "ambos profesores son buenos tomaria nuevamente con ellos."
  ]
}
